-- 2020. 12. 23 practice05

/*
문제 1.
#1 담당 매니저가 배정되어있으나 커미션비율이 없고,
#2 월급이 3000초과인 직원의 
#3 이름, 매니저아이디, 커미션 비율, 월급 출력(45건)

*/

/*
문제 2.
#1 각 부서별로 최고의 급여를 받는 사원의 직원번호(employee_id), 이름(first_name), 급여(salary), 입사일(hire_date), 전화번호(phone_number), 부서번호(department_id) 조회 
#2 조건절비교 방법으로 작성
#3 급여의 내림차순으로 정렬
#4 입사일은 2001-01-13 토요일 형식으로 출력
#5 전화번호는 515-123-4567 형식으로 출력(11건)

*/

/*
문제 3.
매니저별로 평균급여 최소급여 최대급여를 알아보려고 한다.
#1 통계대상(직원)은 2005년 이후의 입사자
#2 매니저별 평균급여가 5000이상만 출력
#3 매니저별 평균급여의 내림차순정렬 출력
#4 매니저별 평균급여는 소수점 첫째자리에서 반올림
#5 출력내용은 매니저아이디, 매니저이름(first_name), 매니저별평균급여, 매니저별최소급여, 매니저별최대급여(9건)

*/

/*
문제 4.
#1 각 사원(employee)에 대해서 사번(employee_id), 이름(first_name), 부서명(department_name), 매니저(manager)의 이름(first_name) 조회
#2 부서가 없는 직원(Kimberely)도 표시(106명)

*/

/*
문제 5.
#1 2005년 이후 입사한 직원중에
#2 입사일이 11번째에서 20번째의 직원의 
#3 사번, 이름, 부서명, 급여, 입사일을 입사일 순서로 출력

*/

/*
문제 6.
#1 가장 늦게 입사한 직원의
#2 이름(first_name last_name)과 연봉(salary)과 근무하는 부서 이름(department_name) 조회

*/

/*
문제 7.
#1 평균연봉(salary)이 가장 높은 부서
#2 직원들의 직원번호(employee_id), 이름(firt_name), 성(last_name)과  업무(job_title), 연봉(salary) 조회

*/

/*
문제 8.
평균 급여(salary)가 가장 높은 부서 조회

*/

/*
문제 9.
평균 급여(salary)가 가장 높은 지역 지역

*/

/*
문제 10.
평균 급여(salary)가 가장 높은 업무 조회 

*/